{
    "skills": [
        {
            "tech": "angular",
            "name": "ng-no-rerenders",
            "description": "Detects and eliminates unnecessary Angular change detection cycles: Default vs OnPush strategy, zone.js over-triggering, signals vs BehaviorSubject re-render cost, trackBy absence in lists, async pipe misuse, and heavy template expressions. Trigger: When user reports Angular performance issues, ExpressionChangedAfterItHasBeenChecked errors, or components re-rendering more than expected."
        },
        {
            "tech": "angular",
            "name": "ng-reviewer-ux",
            "description": "Permite identificar problemas de experiencia de usuario"
        },
        {
            "tech": "angular",
            "name": "ng-solid-dry-kiss",
            "description": "Applies SOLID, DRY, and KISS principles to Angular TypeScript code: single responsibility services and components, open/closed directives and pipes, dependency inversion via interfaces, eliminating duplicated interceptors and resolvers, and avoiding over-engineering. Trigger: When user asks to refactor, review, or architect clean Angular code following software engineering principles."
        },
        {
            "tech": "generic",
            "name": "skill-creator",
            "description": "Creates new skills for monorepo-skills or improves existing ones following repo conventions. Trigger: When user wants to add a new skill, capture a workflow as a reusable skill, refine a SKILL.md, or validate skill structure and frontmatter."
        },
        {
            "tech": "react-native",
            "name": "rn-no-rerenders",
            "description": "Detects and eliminates unnecessary re-renders in React Native: inline objects/arrays/functions in JSX, missing or broken memo, unstable useCallback/useMemo deps, FlatList row churn, derived state in useState, and context over-broadcasting. Trigger: When user reports re-render issues, flickering, FlatList jank, or wants to optimize component rendering performance."
        },
        {
            "tech": "react-native",
            "name": "rn-solid-dry-kiss",
            "description": "Applies SOLID, DRY, and KISS principles to React Native TypeScript code: single responsibility components, open/closed hooks, dependency inversion via props/context, eliminating duplicated logic, and keeping implementations simple over clever. Trigger: When user asks to refactor, review, or write clean React Native code following software engineering principles."
        }
    ]
}
